## pandas program to read csv file and generate schema script for database table
<font color="green">
    <ul>
        <li>The goal of this program is to load CSV data into a local DB</li>
        <li>We will generate schema, create table using that script, and then load data in chunks</li>
        <li>Credits: Thanks to <a href="https://github.com/DataTalksClub/data-engineering-zoomcamp">DataEngineering Zoomcamp</a> for teaching this</li>
    </ul>
</font>

In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.0'

### read the csv file for a small batch, and view it
<font color="green">
    <ul>
        <li>Total of 1369765 records</li>
    </ul>
</font>

In [4]:
df = pd.read_csv('yellow_tripdata_2021-01.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1369765 entries, 0 to 1369764
Data columns (total 18 columns):
 #   Column                 Non-Null Count    Dtype
---  ------                 --------------    -----
 0   VendorID               1271413 non-null  float64
 1   tpep_pickup_datetime   1369765 non-null  object
 2   tpep_dropoff_datetime  1369765 non-null  object
 3   passenger_count        1271413 non-null  float64
 4   trip_distance          1369765 non-null  float64
 5   RatecodeID             1271413 non-null  float64
 6   store_and_fwd_flag     1271413 non-null  object
 7   PULocationID           1369765 non-null  int64
 8   DOLocationID           1369765 non-null  int64
 9   payment_type           1271413 non-null  float64
 10  fare_amount            1369765 non-null  float64
 11  extra                  1369765 non-null  float64
 12  mta_tax                1369765 non-null  float64
 13  tip_amount             1369765 non-null  float64
 14  tolls_amount           1369765 non-null  float64
 15  improvement_surcharge  1369765 non-null  float64
 16  total_amount           1369765 non-null  float64
 17  congestion_surcharge   1369765 non-null  float64
dtypes: float64(13), int64(2), object(3)
memory usage: 188.1+ MB

In [5]:
df = pd.read_csv('yellow_tripdata_2021-01.csv', nrows = 1000)

In [6]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge
0,1,2021-01-01 00:30:10,2021-01-01 00:36:12,1,2.10,1,N,142,43,2,8.0,3.0,0.5,0.00,0.0,0.3,11.80,2.5
1,1,2021-01-01 00:51:20,2021-01-01 00:52:19,1,0.20,1,N,238,151,2,3.0,0.5,0.5,0.00,0.0,0.3,4.30,0.0
2,1,2021-01-01 00:43:30,2021-01-01 01:11:06,1,14.70,1,N,132,165,1,42.0,0.5,0.5,8.65,0.0,0.3,51.95,0.0
3,1,2021-01-01 00:15:48,2021-01-01 00:31:01,0,10.60,1,N,138,132,1,29.0,0.5,0.5,6.05,0.0,0.3,36.35,0.0
4,2,2021-01-01 00:31:49,2021-01-01 00:48:21,1,4.94,1,N,68,33,1,16.5,0.5,0.5,4.06,0.0,0.3,24.36,2.5

### Connect to DB and Generate Schema for inserting the data
<font color="green">
    <ul>
        <li>we will use SQLAlchemy to connect to postgres DB running the local docker container</li>
        <li> we will generate create script schema using SQLAlchemy</li>
        <li> we need to set the two timestamp columns type to be datetime for SQLAlchemy to interpret type</li>
    </ul>
</font>

In [7]:
df['tpep_pickup_datetime']= pd.to_datetime(df.tpep_pickup_datetime)
df['tpep_dropoff_datetime']= pd.to_datetime(df.tpep_dropoff_datetime)

In [8]:
from sqlalchemy import create_engine

In [11]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [12]:
engine.connect()

In [11]:
print(pd.io.sql.get_schema(df, name='yellow_taxi_trips', con=engine))

CREATE TABLE yellow_taxi_trips (
	"VendorID" BIGINT,
	tpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	tpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	"RatecodeID" BIGINT,
	store_and_fwd_flag TEXT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	payment_type BIGINT,
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	congestion_surcharge FLOAT(53)
)

#### Test the postgres connection

In [12]:
query = """
SELECT 1 as number;
"""

pd.read_sql(query, con=engine)

   number
0       1

#### Check if the yellow_taxi_data  table is created

In [13]:
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine)

Empty DataFrame
Columns: [schemaname, tablename, tableowner, tablespace, hasindexes, hasrules, hastriggers, rowsecurity]
Index: []

### Connect to DB and Create table and insert first batch of records
<font color="green">
    <ul>
        <li>The goal is to first create the table and then insert all the ~1 million records in batches</li>
        <li> we will create iterator and open it in chunks of 100k to write to DB</li>
        <li> Step1 will be to write n=0 row which will create the table with the columns in postgres</li>
        <li> Step2 will write the first 100k chunk to make sure all looks good </li>
    </ul>
</font>

In [14]:
df_iter = pd.read_csv('yellow_tripdata_2021-01.csv', iterator = True, chunksize=100000)

In [15]:
df_iter

In [16]:
df = next(df_iter)

In [17]:
len(df)

100000

In [18]:
df['tpep_pickup_datetime']= pd.to_datetime(df.tpep_pickup_datetime)
df['tpep_dropoff_datetime']= pd.to_datetime(df.tpep_dropoff_datetime)

In [19]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge
0,1,2021-01-01 00:30:10,2021-01-01 00:36:12,1,2.10,1,N,142,43,2,8.0,3.0,0.5,0.00,0.0,0.3,11.80,2.5
1,1,2021-01-01 00:51:20,2021-01-01 00:52:19,1,0.20,1,N,238,151,2,3.0,0.5,0.5,0.00,0.0,0.3,4.30,0.0
2,1,2021-01-01 00:43:30,2021-01-01 01:11:06,1,14.70,1,N,132,165,1,42.0,0.5,0.5,8.65,0.0,0.3,51.95,0.0
3,1,2021-01-01 00:15:48,2021-01-01 00:31:01,0,10.60,1,N,138,132,1,29.0,0.5,0.5,6.05,0.0,0.3,36.35,0.0
4,2,2021-01-01 00:31:49,2021-01-01 00:48:21,1,4.94,1,N,68,33,1,16.5,0.5,0.5,4.06,0.0,0.3,24.36,2.5

In [20]:
df.head(n=0)

Empty DataFrame
Columns: [VendorID, tpep_pickup_datetime, tpep_dropoff_datetime, passenger_count, trip_distance, RatecodeID, store_and_fwd_flag, PULocationID, DOLocationID, payment_type, fare_amount, extra, mta_tax, tip_amount, tolls_amount, improvement_surcharge, total_amount, congestion_surcharge]
Index: []

In [21]:
df.head(n=0).to_sql(name='yellow_taxi_trips', con=engine, if_exists='replace')

0

#### check the table is created or not

In [22]:
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,yellow_taxi_trips,root,None,True,False,False,False

In [23]:
%time df.to_sql(name='yellow_taxi_trips', con=engine, if_exists ='append')

CPU times: user 5.21 s, sys: 160 ms, total: 5.37 s
Wall time: 10.2 s

1000

#### check if the first 100k is inserted

In [24]:
query = """
SELECT count(*) FROM yellow_taxi_trips;
"""

pd.read_sql(query, con=engine)

    count
0  100000

### Insert remaining records
<font color="green">
    <ul>
        <li>We will next loop through the iterator and write all the chunks in batches until there are no more </li>
    </ul>
</font>

In [25]:
from time import time

In [26]:
try:
    while True:
        start_t = time()

        df = next(df_iter)

        df['tpep_pickup_datetime']= pd.to_datetime(df.tpep_pickup_datetime)
        df['tpep_dropoff_datetime']= pd.to_datetime(df.tpep_dropoff_datetime)

        df.to_sql(name='yellow_taxi_trips', con=engine, if_exists ='append') 

        end_t = time()
        print('inserted a chunk of data,  time taken: %.3f second'%(end_t-start_t))
except StopIteration:
    print('finished inserting all data')

inserted a chunk of data,  time taken: 11.039 second
inserted a chunk of data,  time taken: 10.807 second
inserted a chunk of data,  time taken: 10.693 second
inserted a chunk of data,  time taken: 10.464 second
inserted a chunk of data,  time taken: 10.640 second
inserted a chunk of data,  time taken: 10.505 second
inserted a chunk of data,  time taken: 10.363 second
inserted a chunk of data,  time taken: 10.640 second
inserted a chunk of data,  time taken: 11.446 second
inserted a chunk of data,  time taken: 12.672 second
inserted a chunk of data,  time taken: 11.069 second
inserted a chunk of data,  time taken: 10.416 second
inserted a chunk of data,  time taken: 6.777 second
finished inserting all data

#### check the final count of data in the table

In [27]:
query = """
SELECT count(*) FROM yellow_taxi_trips;
"""

pd.read_sql(query, con=engine)

     count
0  1369765

In [29]:
query = """
SELECT *
FROM yellow_taxi_trips LIMIT 10;
"""

df = pd.read_sql(query, con=engine)
df.head()

,index,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge
0,0,1,2021-01-01 00:30:10,2021-01-01 00:36:12,1,2.10,1,N,142,43,2,8.0,3.0,0.5,0.00,0.0,0.3,11.80,2.5
1,1,1,2021-01-01 00:51:20,2021-01-01 00:52:19,1,0.20,1,N,238,151,2,3.0,0.5,0.5,0.00,0.0,0.3,4.30,0.0
2,2,1,2021-01-01 00:43:30,2021-01-01 01:11:06,1,14.70,1,N,132,165,1,42.0,0.5,0.5,8.65,0.0,0.3,51.95,0.0
3,3,1,2021-01-01 00:15:48,2021-01-01 00:31:01,0,10.60,1,N,138,132,1,29.0,0.5,0.5,6.05,0.0,0.3,36.35,0.0
4,4,2,2021-01-01 00:31:49,2021-01-01 00:48:21,1,4.94,1,N,68,33,1,16.5,0.5,0.5,4.06,0.0,0.3,24.36,2.5